

jQuery(function() {
//--------------------------------------------------------------------------------------------------------------------------------------------------------------------


/*
 * ウィンドウ上部に戻るためのボタン
 */
var pagetop = jQuery('.go-to-top');

jQuery(window).scroll(function () {

	if ($(this).scrollTop() > 300) {
		pagetop.fadeIn();
	} else {
		pagetop.fadeOut();
	}

});

pagetop.click(function () {

	jQuery('body, html').animate({ scrollTop: 0 }, 800, 'swing');
	return false;
});




//--------------------------------------------------------------------------------------------------------------------------------------------------------------------
});